app/controllers/papers_controller.rb

  def show
    @paper = Paper.find(params[:id])
---
SELECT * FROM `papers` WHERE (`papers`.`id` = 1)

  def edit
    @paper = Paper.find(params[:id])
---
SELECT * FROM `papers` WHERE (`papers`.`id` = 1)

  def update
    @paper = Paper.find(params[:id])

    respond_to do |format|
      if @paper.update_attributes(params[:paper])
---
SELECT * FROM `papers` WHERE (`papers`.`id` = 1)
UPDATE `papers` SET `picture` = '/images/march1.jpg', `picture2` = '/images/march2.jpg', `updated_at` = '2010-10-19 18:47:33' WHERE `id` = 1