app/controllers/viewer_controller.rb

  def showE
   @paper = Paper.find_by_id(params[:id])
---
SELECT * FROM `papers` WHERE (`papers`.`id` = '1') LIMIT 1

  def show
   @paper = Paper.find_by_name(params[:name])
---
SELECT * FROM `papers` WHERE (`papers`.`name` = 'programmes') LIMIT 1